python/throught_aware_router_demo/results/2025-03-29_16-43-34/only_one/experiment_1/benchmark.log
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, dataset_name='sharegpt', dataset_path='./LARGER_GAP_short_80_long_20_sharegpt_requests.json', model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, num_prompts=100, sharegpt_output_len=50, random_input_len=None, random_output_len=None, random_range_ratio=0.0, request_rate=inf, seed=1, multi=False, request_rate_range='2,34,2', output_file=None, disable_tqdm=False, disable_stream=False, disable_ignore_eos=False, extra_request_body=None, max_concurrency=32, gen_num_groups=64, gen_prompts_per_group=16, gen_system_prompt_len=2048, gen_question_len=128, gen_output_len=256)

Total number of conversations: 10925
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
100%|██████████| 100/100 [00:04<00:00, 23.36it/s]
outputs[0].ttft = 0.6545601309990161
outputs[1].ttft = 0.6541986769989308
outputs[2].ttft = 0.6537720899996202
outputs[3].ttft = 0.6536073440001928
outputs[4].ttft = 0.6531892929997412
outputs[5].ttft = 0.6530736719996639
outputs[6].ttft = 0.6525298810011009
outputs[7].ttft = 0.6871007150002697
outputs[8].ttft = 0.7224763319991325
outputs[9].ttft = 0.7568493359995045
outputs[10].ttft = 0.824376544000188
outputs[11].ttft = 0.8593831199996202
outputs[12].ttft = 1.1762070330005372
outputs[13].ttft = 1.1755379690002883
outputs[14].ttft = 1.1753642709991254
outputs[15].ttft = 1.175365265000437
outputs[16].ttft = 1.1751218200006406
outputs[17].ttft = 1.1748302270007116
outputs[18].ttft = 1.1746613930008607
outputs[19].ttft = 1.1744205340000917
outputs[20].ttft = 1.1742737240001588
outputs[21].ttft = 1.2099349509990134
outputs[22].ttft = 1.2797992750001868
outputs[23].ttft = 1.3836794599992572
outputs[24].ttft = 1.3834475109997584
outputs[25].ttft = 1.3831197660001635
outputs[26].ttft = 1.4951702620001015
outputs[27].ttft = 1.530621574000179
outputs[28].ttft = 1.5301664789985807
outputs[29].ttft = 1.5299600619982812
outputs[30].ttft = 1.5647433529993577
outputs[31].ttft = 1.5994045629995526
outputs[32].ttft = 0.91744135099907
outputs[33].ttft = 1.0542456659986783
outputs[34].ttft = 1.1292583650010783
outputs[35].ttft = 0.0
outputs[36].ttft = 1.1982848160005233
outputs[37].ttft = 1.1981663059996208
outputs[38].ttft = 1.1977343100006692
outputs[39].ttft = 1.2010570729999017
outputs[40].ttft = 1.1332809609994001
outputs[41].ttft = 1.133577847998822
outputs[42].ttft = 1.1347121890012204
outputs[43].ttft = 1.136491258001115
outputs[44].ttft = 0.8188185799990606
outputs[45].ttft = 1.1028779249991203
outputs[46].ttft = 1.1023664709991863
outputs[47].ttft = 1.205950120000125
outputs[48].ttft = 1.3116502370012313
outputs[49].ttft = 1.3113185210004303
outputs[50].ttft = 1.3108071719998406
outputs[51].ttft = 1.3106435509998846
outputs[52].ttft = 1.3099479779993999
outputs[53].ttft = 1.279871925000407
outputs[54].ttft = 1.244529166000575
outputs[55].ttft = 1.276864530000239
outputs[56].ttft = 1.5227682149998145
outputs[57].ttft = 1.7008746410010644
outputs[58].ttft = 1.5893204630010587
outputs[59].ttft = 1.5542351530002634
outputs[60].ttft = 1.553833410000152
outputs[61].ttft = 1.553652210999644
outputs[62].ttft = 1.5191609990015422
outputs[63].ttft = 1.5862222129999282
outputs[64].ttft = 1.7599418299996614
outputs[65].ttft = 1.649708812999961
outputs[66].ttft = 1.5795069599989802
outputs[67].ttft = 1.5078255410007841
outputs[68].ttft = 1.50722324599883
outputs[69].ttft = 1.5068440169998212
outputs[70].ttft = 1.5070821459994477
outputs[71].ttft = 1.4728529129988601
outputs[72].ttft = 1.472255214001052
outputs[73].ttft = 1.4366609930002596
outputs[74].ttft = 1.399795732999337
outputs[75].ttft = 1.3641128899998876
outputs[76].ttft = 1.4321857809991343
outputs[77].ttft = 1.1825382790011645
outputs[78].ttft = 1.181859913000153
outputs[79].ttft = 1.0786208609988535
outputs[80].ttft = 0.9380867219988431
outputs[81].ttft = 1.0416993290000391
outputs[82].ttft = 1.076280608000161
outputs[83].ttft = 1.075728245999926
outputs[84].ttft = 1.07504587800031
outputs[85].ttft = 1.0750129610005388
outputs[86].ttft = 1.0743367909999506
outputs[87].ttft = 0.9737406029998965
outputs[88].ttft = 0.804716312999517
outputs[89].ttft = 0.7390760470007081
outputs[90].ttft = 0.7386685799992847
outputs[91].ttft = 0.7383659749993967
outputs[92].ttft = 0.8902660759995342
outputs[93].ttft = 1.0437215069996455
outputs[94].ttft = 1.0434348130002036
outputs[95].ttft = 0.9445418959985545
outputs[96].ttft = 0.6689185769992037
outputs[97].ttft = 0.6682379089997994
outputs[98].ttft = 0.6680795250013034
outputs[99].ttft = 0.6669923700010258

============ Serving Benchmark Result ============
Backend:                                 vllm      
Traffic request rate:                    inf       
Successful requests:                     100       
Long requests:                           11        
Short requests:                          89        
Benchmark duration (s):                  4.28      
Total input tokens:                      48738     
Total generated tokens:                  100       
Total generated tokens (retokenized):    99        
Request throughput (req/s):              23.36     
Input token throughput (tok/s):          11386.72  
Output token throughput (tok/s):         23.36     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1166.75   
Median E2E Latency (ms):                 1175.46   
P95 E2E Latency (ms):                    1586.39   
P99 E2E Latency (ms):                    1701.48   
Long requests Mean E2E Latency (ms):     1267.8128413635106
Short requests Mean E2E Latency (ms):    1154.2597542245837
Long requests Median E2E Latency (ms):   1199.0104359992984
Short requests Median E2E Latency (ms):  1175.3717259998666
Long requests P95 E2E Latency (ms):      1673.0961189996378
Short requests P95 E2E Latency (ms):     1573.6125183993863
Long requests P99 E2E Latency (ms):      1742.5809957994716
Short requests P99 E2E Latency (ms):     1655.8601902397643
---------------Time to First Token----------------
Mean TTFT (ms):                          1154.75   
Median TTFT (ms):                        1175.36   
P95 TTFT (ms):                           1586.38   
P99 TTFT (ms):                           1701.47   
Long Requests Mean TTFT (ms):            1158.80   
Short Requests Mean TTFT (ms):           1154.25   
Long Requests Median TTFT (ms):          1176.21   
Short Requests Median TTFT (ms):         1175.36   
Long Requests P95 TTFT (ms):             1673.08   
Short Requests P95 TTFT (ms):            1573.60   
Long Requests P99 TTFT (ms):             1742.57   
Short Requests P99 TTFT (ms):            1655.85   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================